CREATE DATABASE `hero` CHARACTER SET utf8;
CREATE TABLE `sanguo` (
    id  int primary key auto_increment,
    country enum('魏','蜀','吴'),
    name varchar (30) not null ,
    genger enum('女','男'),
    attack smallint, 
    defense tinyint
);

insert into sanguo values
(1,'魏','曹操','男',120,33),
(2,'魏','司马懿','男',140,34),
(3,'魏','夏侯渊','男',220,43),
(4,'魏','张辽','男',180,24),
(5,'魏','甄宓','女',210,82),
(6,'蜀','刘备','男',420,100),
(7,'蜀','关羽','男',320,99),
(8,'蜀','赵云','男',180,87),
(9,'蜀','诸葛亮','男',190,81),
(10,'蜀','张飞','男',210,99),
(11,'蜀','孙尚香','女',220,56),
(12,'吴','周瑜','男',230,34),
(13,'吴','大乔','女',170,65),
(14,'吴','小乔','女',220,77),
(15,'吴','陆逊','男',100,23),
(16,'吴','吕蒙','男',110,12);
